'''def a(num):
    b = []
    for i in range(num):
        c = i * i
        if c < num:
            print(c)

a(int(input('Enter a positive number: ')))'''

#----------------------------------------------------------------------------------------------------------------------------------------

#HW2
'''1.
说出下面代码的执行结果
string = "Python is good"
string[1:20]
string[3:-4]
string[-10:-3]'''

#Answer: 什么也没有，因为没有print或任何别的运行。

#----------------------------------------------------------------------------------------------------------------------------------------

'''2.
lst = [2, 5, 6, 7, 8, 9, 2, 9, 9]
1.找出列表里的最大值
2.找出列表里的最小值
3.找出列表里最大值的个数
5.计算列表里所有元素的和
6.找出元素6在列表中的索引'''

'''lst = [2, 5, 6, 7, 8, 9, 2, 9, 9]

b = lst.index(6)

print('1:')

lst.sort(reverse = True)
print(lst[1])

print('--------------------------------------------------------------------')
print('2:')


lst.sort()
print(lst[1])

print('--------------------------------------------------------------------')
print('3:')

lst.sort(reverse = True)
a = lst[1]
count = 0
for i in lst:
    if a == i:
        count += 1
print(count)

print('--------------------------------------------------------------------')
print('4:')

sm = 0
for i in lst:
    sm += i
print(sm)

print('--------------------------------------------------------------------')

print('5:')

print(b)'''

#----------------------------------------------------------------------------------------------------------------------------------------

'''3.
dic = {
    'python': 95,
    'java': 99,
    'c': 100
}
1. 字典的长度是多少
2. 获得字典里所有values 的和'''

dic = {
    'python': 95,
    'java': 99,
    'c': 100
}

print('1:')
print(len(dic))

print('--------------------------------------------------------------------')
print('2:')

a = 0
for i in dic:
    a += dic[i]
print(a)